[
  {
    "username": "ra561013",
    "subreddit": "r/UlcerativeColitis",
    "title": "Natural treatment?",
    "content": "Hi, 27 (F) just got diagnosed 3 months ago after about a year of bleeding. Started seeing naturopathic doctor because I am scared of western medicine and can’t wrap my mind around this not being caused by an imbalance or infection. \n\nStarted on VSL #3 probiotics for UC, butyrate, GI Complete, and Fibermend supplements. Had bleeding go away for about a month but it’s back again and worse. She now wants me to take food sensitivity testing. I have cut out gluten and lactose to see if it will help, it hasn’t.\n\nGoing in for another scope soon, but I know it’s not going to look good. Does anybody have experience with trying the natural ways? Has anybody had success? \n\nAlso, how do you explain this to work people when it doesn’t look or sound like you have issues?\n\n\nEdit: thank you all so much for the responses, and tough love in a sense. I think it’s helped me come to terms in a way and I decided I will do both medicine routes because I realize now how serious this is. It’s scary but I can’t describe how thankful I am for all of your time in responding.",
    "score": 0,
    "comments": 52,
    "awards": 0,
    "engagementScore": 104.0,
    "permalink": "/r/UlcerativeColitis/comments/18bt1nc/natural_treatment/",
    "isFalse": true,
    "category": "Natural Remedy Exaggeration",
    "evidence": "While some natural substances have medicinal properties, claims of curing serious conditions often lack scientific support.",
    "created_at": "2023-12-06T07:34:36",
    "false_confidence": 0.8655999999999999,
    "true_confidence": 0.14479999999999998,
    "not_known_confidence": 0.048960000000000004
  },
  {
    "username": "Raoul27",
    "subreddit": "r/neuropathy",
    "title": "Is there any natural treatment for neuropathy? Oils, plants, herbal tea?",
    "content": "Is there any natural treatment for neuropathy? Oils, plants, CBD, tea?",
    "score": 19,
    "comments": 21,
    "awards": 0,
    "engagementScore": 61.0,
    "permalink": "/r/neuropathy/comments/1j76xgl/is_there_any_natural_treatment_for_neuropathy/",
    "isFalse": true,
    "category": "Natural Remedy Exaggeration",
    "evidence": "While some natural substances have medicinal properties, claims of curing serious conditions often lack scientific support.",
    "created_at": "2025-03-09T18:18:31",
    "false_confidence": 0.85915,
    "true_confidence": 0.14695,
    "not_known_confidence": 0.04939
  },
  {
    "username": "cancerthrowmeaway",
    "subreddit": "r/offmychest",
    "title": "I’m glad I have cancer.",
    "content": "I was diagnosed in early December with a rare form of breast cancer, Inflammatory Breast Cancer. Stage 4 de novo. It’s like regular breast cancer, but significantly more aggressive and a lot worse. I was diagnosed 9 days before my birthday and a week and a half after losing my job. It’s just been shit luck after shit luck since then.\n\nI have a small group of people in my life who love me and support me however they can. My finances are in the toilet and I’ll probably have to file for bankruptcy soon, even after having qualified for federal disability payments due to being diagnosed with a disorder that is guaranteed to end in death (their words, not mine). My life is just stressor after stressor after stressor.\n\nI’ve completed over 20 rounds of IV chemo and look like a gremlin as a result. No hair, my fingernails and toenails are horrific, and of course none of that glamorous Hollywood cancer weight loss—try weight gain. And a lot of it. It sucks. Now I’m supposed to take pills and eventually have a mastectomy and maybe have my ovaries out too, and along the way probably once or twice need my lungs drained of fluid, hope upon hope that my many many tumors don’t infiltrate my brain too, and eventually in about 4-5 years I’ll kick the bucket.\n\nThe real off my chest bit here is that I wish it would just happen faster. Cancer is the most tedious, brutally painful, absolute slowest marathon and I am just done with it.\n\nI have an appointment with my oncologist next week and I’m going to ask about hospice. How close to deaths door do I need to be to quality. When can I just say, enough is enough. I used to have things I looked forward to, things I wouldn’t want to miss if I were dead, but I don’t have any of that anymore. I just want it to be over. I’m sick of the endless financial stress and the endless cancer aches and pains and the endless infusions and appointments and hospitalizations. I’m just done with it all.\n\nAnd now I’m going to tell you my greatest secret ever. I’ve already stopped taking my cancer meds. I throw them out instead of taking them. Because I WANT my tumors to grow, I want the blood clots in my lungs to grow, I want it all to get worse so I can finally just enter hospice and be done with it. I’m so tired.\n\nAnd I’m only 34.",
    "score": 3178,
    "comments": 203,
    "awards": 0,
    "engagementScore": 3584.0,
    "permalink": "/r/offmychest/comments/1f4pmdd/im_glad_i_have_cancer/",
    "isFalse": false,
    "category": "General Health",
    "evidence": "This post doesn't contain common misinformation markers.",
    "created_at": "2024-08-30T13:19:37",
    "false_confidence": 1.3876,
    "true_confidence": -0.02920000000000003,
    "not_known_confidence": 0.014159999999999999
  },
  {
    "username": "amdtek",
    "subreddit": "r/rheumatoid",
    "title": "Natural Herbs & Rheumatoid Arthritis",
    "content": "I heard natural herbs like turmeric and ginger will curb the inflammation arising in rheumatoid arthritis. Does that further translate to curing it if they are consumed regularly in high dose regularly?\n\nSecond question is, can these herbs cure the deformities occuring due to this?\n\nI have zero pain but has to live with the deformities in my hands and toes, something which I'd like to find a cure for.",
    "score": 0,
    "comments": 16,
    "awards": 0,
    "engagementScore": 32.0,
    "permalink": "/r/rheumatoid/comments/1gwsddh/natural_herbs_rheumatoid_arthritis/",
    "isFalse": false,
    "category": "General Health",
    "evidence": "This post doesn't contain common misinformation markers.",
    "created_at": "2024-11-22T04:03:45",
    "false_confidence": 0.8548,
    "true_confidence": 0.1484,
    "not_known_confidence": 0.04968
  },
  {
    "username": "BiggieTwiggy1two3",
    "subreddit": "r/Health",
    "title": "Wisconsin Man Who’s Spent Years Letting Deadly Snakes Bite Him May Have Unlocked The Ultimate Antivenom",
    "content": "",
    "score": 18,
    "comments": 2,
    "awards": 0,
    "engagementScore": 22.0,
    "permalink": "/r/Health/comments/1kd802u/wisconsin_man_whos_spent_years_letting_deadly/",
    "isFalse": false,
    "category": "General Health",
    "evidence": "This post doesn't contain common misinformation markers.",
    "created_at": "2025-05-02T23:51:42",
    "false_confidence": 0.8533,
    "true_confidence": 0.1489,
    "not_known_confidence": 0.049780000000000005
  },
  {
    "username": "Fangydangymangy",
    "subreddit": "r/keratosis",
    "title": "Remedy skin",
    "content": "Has anyone tried remedy skin’s body bump lotion? I’m a bit skeptical about how well it works since it’s only 10% urea but it does have retinol.",
    "score": 2,
    "comments": 3,
    "awards": 0,
    "engagementScore": 8.0,
    "permalink": "/r/keratosis/comments/1h01le5/remedy_skin/",
    "isFalse": false,
    "category": "General Health",
    "evidence": "This post doesn't contain common misinformation markers.",
    "created_at": "2024-11-26T08:19:55",
    "false_confidence": 0.8512,
    "true_confidence": 0.14959999999999998,
    "not_known_confidence": 0.049920000000000006
  }
]